6_semester/КИСП/Курсовая/src/Documents/ЗаявкаНаБронь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаявкаНаБронь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

6_semester/КИСП/Курсовая/src/Documents/ЗаявкаНаБронь/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура НачалоСеансаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеСеансаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСумму()
	Если Не ЗначениеЗаполнено(Объект.Тариф) 
		Или Не ЗначениеЗаполнено(Объект.НачалоСеанса) 
		Или Не ЗначениеЗаполнено(Объект.ОкончаниеСеанса) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительностьСекунды = Объект.ОкончаниеСеанса - Объект.НачалоСеанса;
	Если ДлительностьСекунды <= 0 Тогда
		Объект.Сумма = 0;
		Возврат;
	КонецЕсли;
	
	ДлительностьЧасы = ДлительностьСекунды / 3600;
	
	Цена = Объект.Тариф.Цена;
	ТипТарифа = Объект.Тариф.ТипТарифа;
	
	Если ТипТарифа = "Пакет" Тогда
		Объект.Сумма = Цена; // Фиксированная цена за пакет
	Иначе
		Объект.Сумма = Цена * ДлительностьЧасы; // Почасовая оплата
	КонецЕсли;
КонецПроцедуры
